app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
    def index
        @students = Student.all

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        @student = Student.find(params[:id])

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "John"], ["last_name", "Doe"], ["created_at", "2021-03-16 18:25:11.854910"], ["updated_at", "2021-03-16 18:25:11.854910"]]
---
    def create
        @student = Student.new(student_params)
        @student.save